<?php
/**
 * Created by PhpStorm.
 * User: VanessaShopping
 * Date: 12-Mar-17
 * Time: 7:34 PM
 */

$text = '     One Two Three';
echo strlen($text) . '<br>'; // Дължита на текста
echo trim($text) . '<br>'; // Премахва интервали в началото и в края на текста
// ltrim - премахва интервали в началото
// rtrim - премахва интервали в края

echo str_replace('Two', '2', $text) . '<br>'; // Заменя стринга Two със стринга 2 в текста $text


echo strpos($text, 'Two') . '<br>'; // string position
// Ако има съвпадение на това което търсим в текста връща позицията на думата
// Ако в текста "One Two Three" търсим думата Two - ще върне 4, защото думата започва от 4-та позиция в текста
// ОСОБЕННОСТ: Ако търсим дума която започва на нулева позиция и това е условие в иф проверка ще върне false понеже
// в If-а числото ще се конвертира до булева стойност а 0 е false. Тоест дори  и да има такава дума ако започва на нулева позиция
// тя няма да бъде намерена

if (strpos("A B C", "A") !== false) { // === true няма да проработи
    // Идеята е: ако има съвпадение и то е равно на 0 ще провери дали 0 е булев тип. Понеже не е ще влезе в тялото на иф-а
    // Ако няма съвпадение ще върне False
    echo 'Found' . '<br>';
}


$arr[] = "My";
$arr[] = "name";
$arr[] = "is";
$arr[] = "Pesho";
$arrText = implode(" ", $arr);
echo $arrText . '<br>'; // Какво да бъде сложено между всеки един елемент на масива, Втория параметър е самия масив
$textArr = explode(" ", $arrText);
var_dump($textArr);